# MySQL

MySQL is the most popular Open Source Relational SQL Database Management System. MySQL is one of the best RDBMS being used for developing various web-based software applications.This notebook will give you a quick start to MySQL and make you comfortable with MySQL programming.

## Database
A database is a separate application that stores a collection of data. Each database has one or more distinct APIs for creating, accessing, managing, searching and replicating the data it holds.

Nowadays, we use relational database management systems (RDBMS) to store and manage huge volume of data. This is called relational database because all the data is stored into different tables and relations are established using primary keys or other keys known as Foreign Keys.

A Relational DataBase Management System (RDBMS) is a software that −

--> Enables you to implement a database with tables, columns and indexes.

--> Guarantees the Referential Integrity between rows of various tables.

--> Updates the indexes automatically.

--> Interprets an SQL query and combines information from various tables.

## RDBMS Terminology
Before we proceed to explain the MySQL database system, let us revise a few definitions related to the database.

**Database** − A database is a collection of tables, with related data.

**Table** − A table is a matrix with data. A table in a database looks like a simple spreadsheet.

**Column** − One column (data element) contains data of one and the same kind, for example the column postcode.

**Row** − A row (= tuple, entry or record) is a group of related data, for example the data of one subscription.

**Redundancy** − Storing data twice, redundantly to make the system faster.

**Primary Key** − A primary key is unique. A key value can not occur twice in one table. With a key, you can only find one row.

**Foreign Key** − A foreign key is the linking pin between two tables.

**Compound Key** − A compound key (composite key) is a key that consists of multiple columns, because one column is not sufficiently unique.

**Index** − An index in a database resembles an index at the back of a book.

**Referential Integrity** − Referential Integrity makes sure that a foreign key value always points to an existing row.

## Create Database

To create a database, type the following command. Replace dbname with the name of the database that you want to create:

In [ ]:
CREATE DATABASE dbname; # CREATE DATABASE <name_of_the_database>

To work with the new database, type the following command:

In [ ]:
USE dbname; #USE <name_of_the_database>

You can also verify the database selected using the command:

In [ ]:
SELECT DATABASE(); # To check the selected database

To list the databases created till now and to check the available databases, we can write the following command on the command line interface

In [ ]:
show databases; # Show all the databases created till now

To drop a database-

In [ ]:
DROP DATABASE dbname; # DROP DATABASE <name_of_the_database>

## Data Types

#### Numeric Types- INT, SMALLINT, TINTINT, MEDIUMINT, BIGINT, DECIMAL, NUMERIC, FLOAT, DOUBLE, BIT 
#### String Types-CHAR, VARCHAR, BINARY, VARBINARY, BLOB, TINYBLOB, MEDIUMBLOB, LONGBLOB, TEXT, TINYTEXT, MEDIUMTEXT, LONGTEXT, ENUM
#### Date Times- DATE, DATETIME, TIMESTAMP, TIME, YEAR

## Create Table

|Name  |Breed        |Age|
|----  |-------------|---|
|Blue  |Scottish Fold|1  |
|Rocket|Persian      |3  |
|Monty |Tabby        |10 |
|Sam   |Munchkin     |5  |

You can create a table in Mysql in a particular selected database using the following syntax:

In [ ]:
CREATE TABLE table_name(column_name_1 data_type_1,
                        column_name_2 data_type_2); #CREATE TABLE <name_of_the_table>(column_name_1 data_type_1,
                                                    #column_name_2 data_type_2)

here table_name is the name of the table you want to create. You can change this name according to your own requirement

#### A Simple Example for creating a Table

In [ ]:
CREATE TABLE cats
  (
name VARCHAR(100),
age INT
  );

In order to view the tables we created, we can type:

In [ ]:
SHOW TABLES;

If you want to get a jist of the table you created, you can type one of the following commands on the cli:

In [ ]:
SHOW COLUMNS FROM tablename;
#OR
DESC tablename;

### INSERTING INTO TABLE:
The INSERT INTO statement is used to insert new records in a table.

In [ ]:
INSERT INTO tablename(column_name_1,column_name_2) VALUES(value_for_col_1,val_for_col_2);

This above line of code inserts a row into the mysql table

#### Example for inserting a row into the cats table we created above

In [ ]:
INSERT INTO cats(name, age) VALUES ('Jetson', 7);

To view the table we created and to check the row values we inserted, we can type-

In [ ]:
SELECT * FROM tablename;

#### Example

In [ ]:
SELECT * FROM cats;

If due to some reason a table is not needed anymore, you can delete it using:

In [ ]:
DROP TABLE tablename;

#### Example

In [ ]:
DROP TABLE cats;

### CRUD Operations
#### -->Create
#### -->Read
#### -->Update
#### -->Delete

In [ ]:
#Create using INSERT INTO
INSERT INTO cats(name, age) VALUES(Taco, 14);
DROP TABLE cats;

In [ ]:
CREATE TABLE cats 
  ( 
     cat_id INT NOT NULL AUTO_INCREMENT, 
     name   VARCHAR(100), 
     breed  VARCHAR(100), 
     age    INT, 
     PRIMARY KEY (cat_id) 
  );

In [ ]:
DESC cats;

In [ ]:
INSERT INTO cats(name, breed, age) 
VALUES ('Ringo', 'Tabby', 4),
       ('Cindy', 'Maine Coon', 10),
       ('Dumbledore', 'Maine Coon', 11),
       ('Egg', 'Persian', 4),
       ('Misty', 'Tabby', 13),
       ('George Michael', 'Ragdoll', 9),
       ('Jackson', 'Sphynx', 7);

#### SELECT Statements
The SELECT statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.

In [ ]:
#Read
SELECT * FROM cats;

SELECT name FROM cats;

SELECT age FROM cats;

SELECT cat_id FROM cats;

SELECT name, age FROM cats;

SELECT cat_id, name, age FROM cats;

SELECT age, breed, name, cat_id FROM cats;

SELECT cat_id, name, age, breed FROM cats;

#### Intro to WHERE 
The WHERE clause is used to filter records.

The WHERE clause is used to extract only those records that fulfill a specified condition.

In [ ]:
#Select by age:

SELECT * FROM cats WHERE age=4;

#Select by name:

SELECT * FROM cats WHERE name='Egg';

#Notice how it deals with case:

SELECT * FROM cats WHERE name='egG';

#### Introduction to Aliases
SQL aliases are used to give a table, or a column in a table, a temporary name.

Aliases are often used to make column names more readable.

An alias only exists for the duration of the query.

In [ ]:
SELECT column_name(s)
FROM table_name AS alias_name;

In [ ]:
SELECT cat_id AS id, name FROM cats;

SELECT name AS 'cat name', breed AS 'kitty breed' FROM cats;

DESC cats;

#### Updating Data
The UPDATE statement is used to modify the existing records in a table.

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

In [ ]:
#Change tabby cats to shorthair:

UPDATE cats SET breed='Shorthair' WHERE breed='Tabby';

#Another update:

UPDATE cats SET age=14 WHERE name='Misty';

#### Deleting Data
The DELETE statement is used to delete existing records in a table.

In [ ]:
DELETE FROM table_name WHERE condition;

In [ ]:
DELETE FROM cats WHERE name='Egg';

SELECT * FROM cats;

SELECT * FROM cats WHERE name='egg';

DELETE FROM cats WHERE name='egg';

SELECT * FROM cats;

DELETE FROM cats;

### Running SQL Files
We can run the MySQL queries from a .sql file using source filename.sql

In [ ]:
CREATE TABLE cats
    (
        cat_id INT NOT NULL AUTO_INCREMENT,
        name VARCHAR(100),
        age INT,
        PRIMARY KEY(cat_id)
    );

use cat_app;

source first_file.sql

DESC cats;

In [ ]:
INSERT INTO cats(name, age)
VALUES('Charlie', 17);

INSERT INTO cats(name, age)
VALUES('Connie', 10);

SELECT * FROM cats;

source testing/insert.sql

# The Ultimate MySQL Bootcamp Go from SQL Beginner to Expert

#### Loading our Book Data

In [ ]:
CREATE TABLE books 
    (
        book_id INT NOT NULL AUTO_INCREMENT,
        title VARCHAR(100),
        author_fname VARCHAR(100),
        author_lname VARCHAR(100),
        released_year INT,
        stock_quantity INT,
        pages INT,
        PRIMARY KEY(book_id)
    );

INSERT INTO books (title, author_fname, author_lname, released_year, stock_quantity, pages)
VALUES
('The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
('Norse Mythology', 'Neil', 'Gaiman',2016, 43, 304),
('American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
('Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
('A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
('The Circle', 'Dave', 'Eggers', 2013, 26, 504),
('The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
('Just Kids', 'Patti', 'Smith', 2010, 55, 304),
('A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
('Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
('What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
("Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
('White Noise', 'Don', 'DeLillo', 1985, 49, 320),
('Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
('Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
('Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343);

#### Coding with CONCAT

In [ ]:
SELECT author_fname, author_lname FROM books;

In [ ]:
#Combine data for cleaner output.
CONCAT(column_name,another_column_name)

CONCAT(author_fname, author_lname)

CONCAT(column, 'text', anotherColumn, 'more text')

CONCAT(author_fname, ' ', author_lname)

SELECT CONCAT('Hello', 'World');

SELECT CONCAT('Hello', '...', 'World');

SELECT
  CONCAT(author_fname, ' ', author_lname)
FROM books;

SELECT
  CONCAT(author_fname, ' ', author_lname) AS 'full name'
FROM books;

SELECT author_fname AS first, author_lname AS last, 
  CONCAT(author_fname, ' ', author_lname) AS full
FROM books;

SELECT author_fname AS first, author_lname AS last, 
  CONCAT(author_fname, ', ', author_lname) AS full
FROM books;

SELECT CONCAT(title, '-', author_fname, '-', author_lname) FROM books;

SELECT 
    CONCAT_WS(' - ', title, author_fname, author_lname) 
FROM books;

#### INTRODUCING SUBSTRING/SUBSTR

In [ ]:
SELECT SUBSTRING('Hello World', 1, 4);
gives output- Hell

In [ ]:
SELECT SUBSTRING('Hello World', 7);
gives output- World

In [ ]:
SELECT SUBSTRING('Hello World', -3);
gives output- rld

In [ ]:
SELECT CONCAT
(
SUBSTRING(title, 1, 10),
'...'
)
FROM books;

In [ ]:
SELECT CONCAT
(
SUBSTRING(title, 1, 10),
'...'
) AS 'short title'
FROM books;

#### INTRODUCING REPLACE

In [ ]:
SELECT REPLACE('Hello World', 'Hell', '%$#@');
#removes hell and replace with %$#@

In [ ]:
SELECT
  REPLACE('cheese bread coffee milk', ' ', ' and ');
#gives output- cheese and bread and coffee and milk

In [ ]:
SELECT REPLACE(title, 'e ', '3') FROM books;

In [ ]:
#Using substring and replace together as:-
SELECT SUBSTRING
(
    replace(title,'e','3'),1,10
) AS 'weird string'
FROM books;

#### Using REVERSE

In [ ]:
SELECT REVERSE('Hello World');
gives output- dlroW olleH

In [ ]:
SELECT REVERSE(author_fname) FROM books;

In [ ]:
#CONCAT and REVERSE
SELECT CONCAT('woof', REVERSE('woof'));

#### Working with CHAR LENGTH

In [ ]:
SELECT CHAR_LENGTH('Hello World');
gives output- 11

In [ ]:
#CONCAT
SELECT CONCAT(author_lname, ' is ', CHAR_LENGTH(author_lname), ' characters long') FROM books;

#### Changing Case with UPPER and LOWER

In [ ]:
SELECT UPPER('Hello World');
gives output- HELLO WORLD

In [ ]:
SELECT LOWER(title) FROM books;

In [ ]:
SELECT CONCAT('MY FAVORITE BOOK IS ', UPPER(title)) FROM books;

In [ ]:
#Books Data
INSERT INTO books
    (title, author_fname, author_lname, released_year, stock_quantity, pages)
    VALUES ('10% Happier', 'Dan', 'Harris', 2014, 29, 256), 
           ('fake_book', 'Freida', 'Harris', 2001, 287, 428),
           ('Lincoln In The Bardo', 'George', 'Saunders', 2017, 1000, 367);


SELECT title FROM books;

#### Using DISTINCT
The DISTINCT statement is used to return only distinct (different) values.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

In [ ]:
SELECT DISTINCT author_lname FROM books;
#used to remove duplicates

In [ ]:
SELECT DISTINCT author_fname, author_lname FROM books;

#### Sorting data by ORDERBY
The ORDER BY keyword is used to sort the result-set in ascending or descending order.

The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword.

In [ ]:
SELECT author_lname FROM books ORDER BY author_lname DESC;
# for descending ordering of author_lname in the books table

#### Using LIMIT

In [ ]:
SELECT title FROM books LIMIT 3;

In [ ]:
SELECT title, released_year FROM books 
ORDER BY released_year DESC LIMIT 5;

#### Better Searches with LIKE
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

% - The percent sign represents zero, one, or multiple characters

_ - The underscore represents a single character

In [ ]:
SELECT title, author_fname FROM books WHERE author_fname LIKE '%da%';
SELECT title, author_fname FROM books WHERE author_fname LIKE 'da%';

### Aggregate Functions

#### COUNT FUNCTION
The COUNT() function returns the number of rows that matches a specified criteria.

In [ ]:
SELECT COUNT(column_name)
FROM table_name
WHERE condition;

In [ ]:
SELECT COUNT(*) FROM books;

In [ ]:
SELECT COUNT(DISTINCT author_lname, author_fname) FROM books;

#### GROUPBY
The GROUP BY statement group rows that have the same values into summary rows, like "find the number of customers in each country".

The GROUP BY statement is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);

In [ ]:
SELECT title, author_lname FROM books;

In [ ]:
SELECT title, author_lname FROM books
GROUP BY author_lname
SELECT author_lname, COUNT(*) 
FROM books GROUP BY author_lname;

#### AVERAGE/AVG()
The AVG() function returns the average value of a numeric column.

In [ ]:
SELECT AVG(column_name)
FROM table_name
WHERE condition;

In [ ]:
SELECT AVG(released_year) 
FROM books;

In [ ]:
SELECT AVG(stock_quantity) 
FROM books 
GROUP BY released_year;

#### SUM()
The SUM() function returns the total sum of a numeric column.

In [ ]:
SELECT SUM(column_name)
FROM table_name
WHERE condition;

In [ ]:
SELECT SUM(pages) FROM books;

In [ ]:
SELECT author_fname,
       author_lname,
       Sum(pages)
FROM books
GROUP BY
    author_lname,
    author_fname;

#### MIN() and MAX()
The MIN() function returns the smallest value of the selected column.

The MAX() function returns the largest value of the selected column.

In [ ]:
#MIN Syntax
SELECT MIN(column_name)
FROM table_name
WHERE condition;

In [ ]:
#MAX Syntax
SELECT MAX(column_name)
FROM table_name
WHERE condition;

In [ ]:
SELECT MIN(released_year) 
FROM books;

In [ ]:
SELECT MAX(pages) 
FROM books;

In [ ]:
#Using Min and Max with Group By
SELECT
  author_fname,author_lname,Max(pages)
FROM books
GROUP BY author_lname,
         author_fname;

#### Revisiting DataTypes

In [ ]:
#VARCHAR
CREATE TABLE dogs (name CHAR(5), breed VARCHAR(10));

INSERT INTO dogs (name, breed) VALUES ('bob', 'beagle');

In [ ]:
#DECIMAL
CREATE TABLE items(price DECIMAL(5,2));

INSERT INTO items(price) VALUES(7);

In [ ]:
#FLOAT and DOUBLE
CREATE TABLE thingies (price FLOAT);

INSERT INTO thingies(price) VALUES (88.45);

In [ ]:
#DATE, TIME and DATETIME
CREATE TABLE people (name VARCHAR(100), birthdate DATE, birthtime TIME, birthdt DATETIME);

INSERT INTO people (name, birthdate, birthtime, birthdt)
VALUES('Padma', '1983-11-11', '10:07:35', '1983-11-11 10:07:35');

In [ ]:
#CURDATE, CURTIME and NOW
INSERT INTO people (name, birthdate, birthtime, birthdt)
VALUES('Toaster', CURDATE(), CURTIME(), NOW());

CURDATE()- Gives current date

CURTIME()- Gives current time

NOW()- Gives current datetime

#### Formatting Dates

In [ ]:
SELECT name, DAY(birthdate) FROM people;

In [ ]:
SELECT name, birthdate, DAYNAME(birthdate) FROM people;

In [ ]:
SELECT name, birthdate, DAYOFWEEK(birthdate) FROM people;

In [ ]:
SELECT name, birthdate, DAYOFYEAR(birthdate) FROM people;

In [ ]:
SELECT name, birthdt, MONTH(birthdt) FROM people;

In [ ]:
SELECT name, birthtime, HOUR(birthtime) FROM people;

#### Date Math

In [ ]:
SELECT DATEDIFF(NOW(), birthdate) FROM people;

In [ ]:
SELECT birthdt, DATE_ADD(birthdt, INTERVAL 1 MONTH) FROM people;

In [ ]:
SELECT birthdt, birthdt + INTERVAL 1 MONTH FROM people;

#### Working with TIMESTAMP()

In [ ]:
CREATE TABLE comments (
    content VARCHAR(100),
    created_at TIMESTAMP DEFAULT NOW()
);
INSERT INTO comments (content) VALUES('lol what a funny article');
INSERT INTO comments (content) VALUES('I found this offensive');
INSERT INTO comments (content) VALUES('Ifasfsadfsadfsad');
SELECT * FROM comments ORDER BY created_at DESC;

### Logical Operators

#### Not Equal(!=)

In [ ]:
SELECT title FROM books WHERE released_year != 2017;

In [ ]:
SELECT title, author_lname FROM books WHERE author_lname != 'Harris';

#### NOT LIKE

In [ ]:
SELECT title FROM books WHERE title NOT LIKE 'W%';

#### Greater Than(>)

In [ ]:
SELECT title, released_year FROM books 
WHERE released_year > 2000 ORDER BY released_year;

In [ ]:
SELECT title, stock_quantity FROM books WHERE stock_quantity >= 100;

In [ ]:
SELECT 99>1;

#### Less Than(<)

In [ ]:
SELECT title, released_year FROM books
WHERE released_year < 2000;

In [ ]:
SELECT 3 < -10;

#### Logical AND

In [ ]:
SELECT  
    title, 
    author_lname, 
    released_year FROM books
WHERE author_lname='Eggers' 
    AND released_year > 2010;

In [ ]:
SELECT 1 < 5 && 7 = 9;
#returns 0 or 1 based on the condition

#### Logical OR

In [ ]:
SELECT 
    title, 
    author_lname, 
    released_year 
FROM books
WHERE author_lname='Eggers' || released_year > 2010;

In [ ]:
SELECT 40 <= 100 || -2 > 0;

#### BETWEEN
The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.

The BETWEEN operator is inclusive: begin and end values are included.

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE column_name BETWEEN value1 AND value2;

In [ ]:
SELECT title, released_year FROM books WHERE released_year >= 2004 && released_year <= 2015;
#or
SELECT title, released_year FROM books 
WHERE released_year BETWEEN 2004 AND 2015;

#### IN and NOT IN
The IN operator allows you to specify multiple values in a WHERE clause.

The IN operator is a shorthand for multiple OR conditions.

In [ ]:
SELECT 
    title, 
    author_lname 
FROM books
WHERE author_lname='Carver' OR
      author_lname='Lahiri' OR
      author_lname='Smith';

SELECT title, author_lname FROM books
WHERE author_lname IN ('Carver', 'Lahiri', 'Smith');

In [ ]:
SELECT title, released_year FROM books
WHERE released_year IN (2017, 1985);

#### CASE Statements

In [ ]:
SELECT title, released_year,
       CASE 
         WHEN released_year >= 2000 THEN 'Modern Lit'
         ELSE '20th Century Lit'
       END AS GENRE
FROM books;

In [ ]:
SELECT title, stock_quantity,
    CASE 
        WHEN stock_quantity BETWEEN 0 AND 50 THEN '*'
        WHEN stock_quantity BETWEEN 51 AND 100 THEN '**'
        ELSE '***'
    END AS STOCK
FROM books;

When there exist a relationship between two mysql tables like orders and customers, students and teachers, movies and reviews.
And there are basically three types of relationships:-
1. One to One Relationship
2. One to Many Relationship
3. Many to Many Relationship
One to One Relationship are not that common

### One to Many (Customers and Orders)
The Most Common Relationship.

***Customer table*** - first_name,last_name,email

***Orders table*** - order_id,order_date,amount,customer_id

Implemented using PRIMARY KEY and FOREIGN KEY

#### Working with Foreign Key.

In [ ]:
# Create customers and orders table
CREATE TABLE customers(
    id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    email VARCHAR(100)
);
CREATE TABLE orders(
    id INT AUTO_INCREMENT PRIMARY KEY,
    order_date DATE,
    amount DECIMAL(8,2),
    customer_id INT,
    FOREIGN KEY(customer_id) REFERENCES customers(id)
);

In [ ]:
#Inserting into customers and orders
INSERT INTO customers (first_name, last_name, email) 
VALUES ('Boy', 'George', 'george@gmail.com'),
       ('George', 'Michael', 'gm@gmail.com'),
       ('David', 'Bowie', 'david@gmail.com'),
       ('Blue', 'Steele', 'blue@gmail.com'),
       ('Bette', 'Davis', 'bette@aol.com');
       
INSERT INTO orders (order_date, amount, customer_id)
VALUES ('2016/02/10', 99.99, 1),
       ('2017/11/11', 35.50, 1),
       ('2014/12/12', 800.67, 2),
       ('2015/01/03', 12.50, 2),
       ('1999/04/11', 450.25, 5);

In [ ]:
#Gives Error because of our foreign key constraint.No user with id: 98
INSERT INTO orders (order_date, amount, customer_id)
VALUES ('2016/06/06', 33.67, 98);

#### A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

#### CROSS JOIN

In [ ]:
#Finding Orders Placed By George: 2 Step Process
SELECT id FROM customers WHERE last_name='George';
SELECT * FROM orders WHERE customer_id = 1;

In [ ]:
#Find orderss placed by George: Using a subquery 
SELECT * FROM orders WHERE customer_id =
    (
        SELECT id FROM customers
        WHERE last_name='George'
    );

#### INNER JOIN

In [ ]:
#IMPLICIT INNER JOIN
SELECT * FROM customers, orders 
WHERE customers.id = orders.customer_id;

In [ ]:
#EXPLICIT INNER JOIN
SELECT * FROM customers
JOIN orders
    ON customers.id = orders.customer_id;

In [ ]:
#ARBITRARY JOIN - meaningless, but still possible
SELECT * FROM customers
JOIN orders ON customers.id = orders.id;

In [ ]:
#LEFT JOIN
SELECT * FROM customers
LEFT JOIN orders
    ON customers.id = orders.customer_id;
    
    
    
SELECT 
    first_name, 
    last_name,
    IFNULL(SUM(amount), 0) AS total_spent
FROM customers
LEFT JOIN orders
    ON customers.id = orders.customer_id
GROUP BY customers.id
ORDER BY total_spent;

In [ ]:
#RIGHT JOIN
SELECT * FROM customers
RIGHT JOIN orders
ON customers.id = orders.customer_id;



SELECT 
    IFNULL(first_name,'MISSING') AS first, 
    IFNULL(last_name,'USER') as last, 
    order_date, 
    amount, 
    SUM(amount)
FROM customers
RIGHT JOIN orders
    ON customers.id = orders.customer_id
GROUP BY first_name, last_name;

In [ ]:
#Working with ON DELETE CASCADE 
CREATE TABLE customers(
    id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    email VARCHAR(100)
);

CREATE TABLE orders(
    id INT AUTO_INCREMENT PRIMARY KEY,
    order_date DATE,
    amount DECIMAL(8,2),
    customer_id INT,
    FOREIGN KEY(customer_id) 
        REFERENCES customers(id)
        ON DELETE CASCADE
);


INSERT INTO customers (first_name, last_name, email) 
VALUES ('Boy', 'George', 'george@gmail.com'),
       ('George', 'Michael', 'gm@gmail.com'),
       ('David', 'Bowie', 'david@gmail.com'),
       ('Blue', 'Steele', 'blue@gmail.com'),
       ('Bette', 'Davis', 'bette@aol.com');
       
INSERT INTO orders (order_date, amount, customer_id)
VALUES ('2016/02/10', 99.99, 1),
       ('2017/11/11', 35.50, 1),
       ('2014/12/12', 800.67, 2),
       ('2015/01/03', 12.50, 2),
       ('1999/04/11', 450.25, 5);

### Many to One (Reviewers, Series and Reviews)

In [ ]:
#Reviewers table
CREATE TABLE reviewers (
    id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100)
);

#Series table
CREATE TABLE series(
    id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(100),
    released_year YEAR(4),
    genre VARCHAR(100)
);

#Reviews table
CREATE TABLE reviews (
    id INT AUTO_INCREMENT PRIMARY KEY,
    rating DECIMAL(2,1),
    series_id INT,
    reviewer_id INT,
    FOREIGN KEY(series_id) REFERENCES series(id),
    FOREIGN KEY(reviewer_id) REFERENCES reviewers(id)
);



#Inserting Data
INSERT INTO series (title, released_year, genre) VALUES
    ('Archer', 2009, 'Animation'),
    ('Arrested Development', 2003, 'Comedy'),
    ("Bob's Burgers", 2011, 'Animation'),
    ('Bojack Horseman', 2014, 'Animation'),
    ("Breaking Bad", 2008, 'Drama'),
    ('Curb Your Enthusiasm', 2000, 'Comedy'),
    ("Fargo", 2014, 'Drama'),
    ('Freaks and Geeks', 1999, 'Comedy'),
    ('General Hospital', 1963, 'Drama'),
    ('Halt and Catch Fire', 2014, 'Drama'),
    ('Malcolm In The Middle', 2000, 'Comedy'),
    ('Pushing Daisies', 2007, 'Comedy'),
    ('Seinfeld', 1989, 'Comedy'),
    ('Stranger Things', 2016, 'Drama');


INSERT INTO reviewers (first_name, last_name) VALUES
    ('Thomas', 'Stoneman'),
    ('Wyatt', 'Skaggs'),
    ('Kimbra', 'Masters'),
    ('Domingo', 'Cortes'),
    ('Colt', 'Steele'),
    ('Pinkie', 'Petit'),
    ('Marlon', 'Crafford');
    

INSERT INTO reviews(series_id, reviewer_id, rating) VALUES
    (1,1,8.0),(1,2,7.5),(1,3,8.5),(1,4,7.7),(1,5,8.9),
    (2,1,8.1),(2,4,6.0),(2,3,8.0),(2,6,8.4),(2,5,9.9),
    (3,1,7.0),(3,6,7.5),(3,4,8.0),(3,3,7.1),(3,5,8.0),
    (4,1,7.5),(4,3,7.8),(4,4,8.3),(4,2,7.6),(4,5,8.5),
    (5,1,9.5),(5,3,9.0),(5,4,9.1),(5,2,9.3),(5,5,9.9),
    (6,2,6.5),(6,3,7.8),(6,4,8.8),(6,2,8.4),(6,5,9.1),
    (7,2,9.1),(7,5,9.7),
    (8,4,8.5),(8,2,7.8),(8,6,8.8),(8,5,9.3),
    (9,2,5.5),(9,3,6.8),(9,4,5.8),(9,6,4.3),(9,5,4.5),
    (10,5,9.9),
    (13,3,8.0),(13,4,7.2),
    (14,2,8.5),(14,3,8.9),(14,4,8.9);

In [ ]:
#Get Rating for every series table title(series and reviews table)
SELECT 
    title, 
    rating 
FROM series
JOIN reviews
    ON series.id = reviews.series_id;

In [9]:
#Average Rating(series and reviews)
SELECT
    title,
    AVG(rating) as avg_rating
FROM series
JOIN reviews
    ON series.id = reviews.series_id
GROUP BY series.id
ORDER BY avg_rating;

In [ ]:
#Rating by every user(reviewers and reviews)
SELECT
    first_name,
    last_name,
    rating
FROM reviewers
INNER JOIN reviews
    ON reviewers.id = reviews.reviewer_id;

In [ ]:
# Unreviewed series
SELECT title AS unreviewed_series
FROM series
LEFT JOIN reviews
    ON series.id = reviews.series_id
WHERE rating IS NULL;

In [ ]:
# Genre Average Rating
SELECT genre, 
       Round(Avg(rating), 2) AS avg_rating 
FROM   series 
       INNER JOIN reviews 
               ON series.id = reviews.series_id 
GROUP  BY genre;

In [ ]:
# Reviewers Stats
SELECT first_name, 
       last_name, 
       Count(rating)                               AS COUNT, 
       Ifnull(Min(rating), 0)                      AS MIN, 
       Ifnull(Max(rating), 0)                      AS MAX, 
       Round(Ifnull(Avg(rating), 0), 2)            AS AVG, 
       IF(Count(rating) > 0, 'ACTIVE', 'INACTIVE') AS STATUS 
FROM   reviewers 
       LEFT JOIN reviews 
              ON reviewers.id = reviews.reviewer_id 
GROUP  BY reviewers.id;

In [ ]:
#Reviewers Stats with PowerUsers
SELECT first_name, 
       last_name, 
       Count(rating)                    AS COUNT, 
       Ifnull(Min(rating), 0)           AS MIN, 
       Ifnull(Max(rating), 0)           AS MAX, 
       Round(Ifnull(Avg(rating), 0), 2) AS AVG, 
       CASE 
         WHEN Count(rating) >= 10 THEN 'POWER USER' 
         WHEN Count(rating) > 0 THEN 'ACTIVE' 
         ELSE 'INACTIVE' 
       end                              AS STATUS 
FROM   reviewers 
       LEFT JOIN reviews 
              ON reviewers.id = reviews.reviewer_id 
GROUP  BY reviewers.id;

In [ ]:
# Join 3 tables
SELECT 
    title,
    rating,
    CONCAT(first_name,' ', last_name) AS reviewer
FROM reviewers
INNER JOIN reviews 
    ON reviewers.id = reviews.reviewer_id
INNER JOIN series
    ON series.id = reviews.series_id
ORDER BY title;